Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The main exception to this rule occurs when a parameter name for an instance method has the same name as a property of that instance.
ja: この規則に対する主な例外は、インスタンスメソッドのパラメータ名がそのインスタンスのプロパティと同じ名前を持つ時に起こります。

source: The matches succeeds if the ~= operator returns true.
ja: ~=演算子がtrueを返すならば、マッチは成功します。

source: The members of a module access the top-level declarations of that module.
ja: モジュールのメンバーは、そのモジュールのトップレベルの宣言にアクセスします。

source: The members of a named type are named as part of the type’s declaration or extension.
ja: 名前付きの型に属するメンバーは、型の宣言または拡張の一部として命名されます。

source: The members of a tuple are implicitly named using integers in the order they appear, starting from zero.
ja: タプルのメンバーは、整数を使って、それらが現れる順序で、ゼロから始めて、暗黙のうちに名前をつけられます。

source: The memberwise initializer is a shorthand way to initialize the member properties of new structure instances.
ja: メンバー関連イニシャライザは、新しい構造体インスタンスのメンバープロパティを初期化するための略記方法です。

source: The memory for these stored properties is now initialized.
ja: これらの格納プロパティに対するメモリは、今や初期化されます。

source: The memory is not yet initialized.
ja: そのメモリは、まだ初期化されません。

source: The metatype of a class, structure, or enumeration type is the name of that type followed by .Type.
ja: あるクラス、構造体、または列挙型のメタタイプは、その型の名前に.Typeが続くものです。

source: The metatype of a protocol type—not the concrete type that conforms to the protocol at runtime—is the name of that protocol followed by .Protocol.
ja: あるプロトコル型 ― 実行時にそのプロトコルに準拠する具象型ではない ― のメタタイプは、そのプロトコルの名前に.Protocolが続くものです。

source: The method can also assign a completely new instance to its implicit self property, and this new instance will replace the existing one when the method ends.
ja: このメソッドはまた、完全に新しいインスタンスをその暗黙のselfプロパティに代入することができます、そして、そのメソッドが終了するとき、この新しいインスタンスは既存のものを置き換えます。

source: The method can then mutate (that is, change) its properties from within the method, and any changes that it makes are written back to the original structure when the method ends.
ja: このメソッドはそれからそれのプロパティをメソッド内部から変化させること（すなわち変更）ができます、そして、そのメソッドが終了するとき、それが行ったどんな変更も本来の構造体へ書き込まれます。

source: The method returns a new Vector2D instance, whose x and y properties are initialized with the sum of the x and y properties from the two Vector2D instances that are added together.
ja: メソッドは、新しいVector2Dインスタンスを返します、それはxとyプロパティが一緒に加えられる２つのVector2Dインスタンスからのxとyプロパティの合計で初期化されるものです。

source: The middle line has more indentation than the closing quotation marks, so it starts with that extra four-space indentation.
ja: 真ん中の行は終了引用符よりもっと字下げされます、なのでそれは追加の４つの空白の字下げで始まります。

source: The minimum value that a UInt8 can hold is zero, or 00000000 in binary.
ja: UInt8が持つことができる最小限の値は、０、または２進数では00000000です。

source: The minimum value that an Int8 can hold is -128, or 10000000 in binary.
ja: Int8が持つことができる最小限の数は、-128、または２進数での10000000です。

source: The module’s public interface consists of operations like joining and flipping a shape, and those operations return another Shape value.
ja: モジュールのもつパブリックインターフェイスは、形の結合および裏返しのような演算からなります、そしてそれらの演算は別のShape値を返します。

source: The mutating method needs write access to self for the duration of the method, and the in-out parameter needs write access to teammate for the same duration.
ja: 変更メソッドは、selfに対する書き込みアクセスをメソッドの期間中に必要とします、そしてin-outパラメータはteammateに対する書き込みアクセスを同じ期間に必要とします。

source: The name of a call-as-function method is callAsFunction(), or another name that begins with callAsFunction( and adds labeled or unlabeled arguments—for example, callAsFunction(_:_:) and callAsFunction(something:) are also valid call-as-function method names.
ja: call-as-functionメソッドの名前はcallAsFunction()、またはcallAsFunction(で始まりそしてラベル付きまたはラベル無し引数を加える別の名前です — 例えばcallAsFunction(_:_:)およびcallAsFunction(something:)は同様に有効なcall-as-functionメソッド名です。

source: The name of a class
ja: あるクラスの名前

source: The name of a protocol
ja: あるプロトコルの名前

source: The name of each case must be unique.
ja: 各ケース節の名前は、固有でなければなりません。

source: The name of the declaration in which it appears.
ja: それが現れる宣言の名前。

source: The name of the file in which it appears.
ja: それが現れるファイルの名前。

source: The name of the projected value is the same as the wrapped value, except it begins with a dollar sign ($).
ja: 予測値の名前は、ラップされた値と同じです、それがドル記号（$）で始まることを除いては。

source: The nature of the mapping and the type of the returned value is left up to the closure to specify.
ja: マッピング（対応付け）の性質と返される値の型は、指定するクロージャに委ねられます。

source: The nearest thing in Objective-C is the ability to return nil from a method that would otherwise return an object, with nil meaning “the absence of a valid object.” However, this only works for objects—it doesn’t work for structures, basic C types, or enumeration values.
ja: Objective-Cにおいて最も近いものは、オブジェクトを返すメソッドからそうできない場合にnilを返す能力です、そのときnilは「有効なオブジェクトの欠如」を意味しています。しかし、それは単にオブジェクトのためだけに働きます ― それは構造体、基本的なC型、または列挙値のために働きません。

source: The nested incrementer() function captures two values, runningTotal and amount, from its surrounding context.
ja: 入れ子にされたincrementer()関数は、それを取り囲む前後関係から２つの値、runningTotalとamountを捕獲します。

source: The nested enumeration can now be used with any Int value:
ja: 入れ子にされた列挙は今やあらゆるInt値で使われることができます：

source: The new Bicycle class automatically gains all of the characteristics of Vehicle, such as its currentSpeed and description properties and its makeNoise() method.
ja: この新しいBicycleクラスは、自動的にVehicleのすべての特徴を獲得します、例えばそれのcurrentSpeedおよびdescriptionプロパティやそれのmakeNoise()メソッドなど。

source: The new array’s type is inferred from the type of the two arrays you add together:
ja: 新しい配列の型は、あなたが一緒に加える２つの配列の型から推論されます：

source: The new type can then be used wherever its access level permits.
ja: その新しい型はそれから、そのアクセス水準が許すところどこででも使われることができます。

source: The new value is passed to the willSet observer as a constant, and therefore it can’t be changed in the implementation of the willSet clause.
ja: 新しい値は、定数としてwillSetオブザーバーに渡されます、したがって、それはwillSet節の実装の中で変更されることができません。

source: The next code snippet defines three variables of type Person?, which are used to set up multiple references to a new Person instance in subsequent code snippets.
ja: 次のコード断片は、型Person?の３つの変数を定義します、それは、以降のコード断片の中のある１つの新しいPersonインスタンスへの複数の参照を準備するために使われます。

source: The next example creates a subclass of Bicycle for a two-seater bicycle known as a “tandem”:
ja: 次の例は、「タンデム」として知られる２座席自転車のために、Bicycleのサブクラスを作成します：

source: The next example defines a subclass of Document called AutomaticallyNamedDocument.
ja: 次の例は、AutomaticallyNamedDocumentとよばれるDocumentのサブクラスを定義します。

source: The next example defines a subclass of Vehicle called Bicycle:
ja: 次の例は、Bicycleと呼ばれるVehicleのサブクラスを定義します：

source: The next example defines two simple functions called stepForward(_:) and stepBackward(_:).
ja: 次の例は、stepForward(_:)とstepBackward(_:)と呼ばれる２つの単純な関数を定義します。

source: The next several code snippets demonstrate how optional chaining differs from forced unwrapping and enables you to check for success.
ja: 次のいくつかのコード切れっぱしは、どのようにオプショナル連鎖が強制アンラップと異なるか、そして成功をどのようにあなたが確認できるかを例示します。

source: The next snippet defines two subclasses of MediaItem.
ja: 次の断片は、MediaItemの２つのサブクラスを定義します。

source: The next subscript index to the right refers to the element at that index in the array that’s nested one level in.
ja: 次の右の添え字インデックスは、１段階内側の入れ子にされた配列の中のそのインデックスでの要素に言及します。

source: The next three decimal codeUnit values (226, 128, 188) are a three-byte UTF-8 representation of the DOUBLE EXCLAMATION MARK character.
ja: 次の３つの10進のcodeUnit値（226、128、188）は、DOUBLE EXCLAMATION MARK文字の３バイトUTF-8叙述です。

source: The nil-coalescing operator is shorthand for the code below:
ja: nil合体演算子は、以下のコードに対する簡略形です：

source: The nil-coalescing operator provides a more elegant way to encapsulate this conditional checking and unwrapping in a concise and readable form.
ja: nil合体演算子は、この条件検査およびアンラップを簡潔で判読しやすい形式にカプセル化するより洗練された方法を提供します。

source: The notation used to describe the formal grammar of the Swift programming language follows a few conventions:
ja: スウィフトプログラミング言語の形式文法を記述するために使用される表記法は、２、３の規則に従います：

source: The observers are not called when the variable or property is first initialized.
ja: オブザーバーは、変数またはプロパティが最初に初期化されるときには呼ばれません。

source: The only difference is the type of the values that they accept (Int, String, and Double).
ja: 唯一の違いは、それらが受け入れる値の型（Int、String、そしてDouble）です。

source: The only exception is for required initializers (as defined in Required Initializers).
ja: 唯一の例外は、必須イニシャライザに対してです（必須イニシャライザで定義されるように）。

source: The only remaining strong reference to the Apartment instance is from the unit4A variable.
ja: Apartmentインスタンスへの唯一の残っている強い参照は、unit4A変数からです。

source: The operator method is defined as a type method on Vector2D, with a method name that matches the operator to be overloaded (+).
ja: この演算子メソッドは、Vector2D上で型メソッドとして定義され、オーバーロードされる演算子と一致するメソッド名を持ちます（+）。

source: The operator returns a new number whose bits are set to 1 if the bits are equal to 1 in either input number:
ja: この演算子は、どちらかの入力数においてビットが1と等しいならばビットが1に設定される、ある新しい数を返します：

source: The operator returns a new number whose bits are set to 1 where the input bits are different and are set to 0 where the input bits are the same:
ja: この演算子は、入力ビットたちが異なっている所で1に設定され、入力ビットたちが同じである所で0に設定される、ある新しい数を返します：

source: The optimized behavior is known as call by reference; it satisfies all of the requirements of the copy-in copy-out model while removing the overhead of copying.
ja: この最適化挙動は、参照呼び出しとして知られます；それはコピーイン・コピーアウトモデルの要件の全てを満足させる一方でコピーすることのオーバーヘッド（間接的経費）を取り除きます。

source: The optional Int is accessed through optional binding to unwrap the integer and assign the non-optional value to the roomCount variable.
ja: オプショナルのIntは、オプショナル束縛を通してアクセスされることで、整数をアンラップして取り出して、その非オプショナル値をroomCount変数へ割り当てます。

source: The optional version number consists of one to three positive integers, separated by periods.
ja: 随意のバージョン番号は、ビリオドで区切られた、１つから３つの正の整数から成ります。

source: The optional chaining question mark always follows immediately after the part of the expression that is optional.
ja: オプショナル連鎖の疑問符は、常にオプショナルである式部分の直後に続きます。

source: The optional chaining question mark in this subscript call is placed immediately after john.residence, before the subscript brackets, because john.residence is the optional value on which optional chaining is being attempted.
ja: この添え字呼び出しでのオプショナル連鎖の疑問符は、john.residenceの直後、添え字の角括弧の前に置かれます、なぜなら、john.residenceがオプショナル連鎖が試みられているオプショナルの値であるからです。

source: The optional lets you track whether there is currently a player in the game.
ja: オプショナルは、プレーヤーが現在ゲーム中かどうかあなたに追跡させます。

source: The optional pattern provides a convenient way to iterate over an array of optional values in a for-in statement, executing the body of the loop only for non-nil elements.
ja: オプショナルパターンは、for-in文においてオプショナルの値がはいった配列の全体にわたって、ループの本文を非nilの要素のみに実行して、繰り返すための便利な方法を提供します。

source: The order in which modifiers are specified when defining Custom Operators has changed.
ja: あつらえの演算子を定義する時に修飾子が指定される順番は変更されました。

source: The order of arguments in a function call must match the order of parameters in the function’s declaration.
ja: 関数呼び出しにおける引数の順序は、関数の宣言におけるパラメータの順番と一致しなければなりません。

source: The original array is not modified by the sorted(by:) method.
ja: 元の配列は、sorted(by:)メソッドによって修正されません。

source: The other difference between a generic function and a nongeneric function is that the generic function’s name (swapTwoValues(_:_:)) is followed by the placeholder type name (T) inside angle brackets (<T>).
ja: 総称体関数と非総称体関数の間の他の違いは、総称体関数の名前（swapTwoValues(_:_:)）は、後ろにプレースホルダ型名（T）が山形括弧内部（<T>）で続くということです。

source: The other variation of the while loop, known as the repeat-while loop, performs a single pass through the loop block first, before considering the loop’s condition.
ja: whileループのもう一方の変種、repeat-whileループとして知られるものは、ループの条件を考慮する前に、最初に一度だけループ・ブロックの通り抜けを実行します。

source: The output constant (twoThousandAndOne) is inferred to be of type UInt16, because it’s the sum of two UInt16 values.
ja: 出力された定数（twoThousandAndOne）は、型UInt16であると推測されます、それが２つのUInt16値の合計であるので。

source: The output of the compound expression doesn’t change, but the overall intention is clearer to the reader.
ja: 複合式の出力は変わりません、しかし全体的な意図は読者にとってより明らかです。

source: The override of the description property starts by calling super.description, which returns the Vehicle class’s description property.
ja: descriptionプロパティのオーバーライドは、super.descriptionを呼び出すことで始まります、それはVehicleクラスのdescriptionプロパティを返します。

source: The parameter name is used in the implementation of the function.
ja: パラメータ名は、関数の実装内において使われます。

source: The parameter’s Key [https://developer.apple.com/documentation/swift/expressiblebydictionaryliteral/2294108-key] must be ExpressibleByStringLiteral [https://developer.apple.com/documentation/swift/expressiblebystringliteral].
ja: パラメータのKey [https://developer.apple.com/documentation/swift/expressiblebydictionaryliteral/2294108-key]は、ExpressibleByStringLiteral [https://developer.apple.com/documentation/swift/expressiblebystringliteral]でなければなりません。

source: The parentheses around a tuple pattern that contains a single element have no effect.
ja: ただ１つだけの要素を含むタプルパターンのまわりの丸括弧には、効果がありません。

source: The parentheses make it clear that the first two values are considered as part of a separate possible state in the overall logic.
ja: 丸括弧は、最初の２つの値が全体的な論理の中で１つの隔てられたあり得る状態の部分として考慮されることを明白にします。

source: The pattern matches values of that single element’s type.
ja: パターンは、そのただ１つの要素の型の値にマッチします。

source: The patterns can be written over multiple lines if the list is long.
ja: これらのパターンは、そのリストが長いならば、複数行にわたって書かれることができます。

source: The phrase if !allowedEntry can be read as “if not allowed entry.” The subsequent line is only executed if “not allowed entry” is true; that is, if allowedEntry is false.
ja: 語句if !allowedEntryは、「許されたエントリでないならば」と読まれることができます。続く行は「許されたエントリでない」が真である場合；すなわち、allowedEntryがfalseである場合に実行されます。

source: The phrase “of type String” means “can store any String value.” Think of it as meaning “the type of thing” (or “the kind of thing”) that can be stored.
ja: フレーズ「型Stringの」は、「どんなString値でも格納することができる」ことを意味します。それを、格納されることができる「物の型」（または「物の種類」）の意味と思ってください。

source: The placeholder type name doesn’t say anything about what T must be, but it does say that both a and b must be of the same type T, whatever T represents.
ja: プレースホルダ型名はTが何でなければならないかについて何も言いません、しかし、aとbの両方ともが同じ型Tでなければならないと述べます、Tが表わすものが何であれ。

source: The player has now left the game.
ja: プレーヤーは、現在ゲームから離れました。

source: The player moves forward by diceRoll squares, and the game logic checks for any snakes and ladders.
ja: プレーヤーはdiceRoll分の正方形を前進します、そして、ゲーム論理はあらゆるヘビとはしごについて調べます。

source: The player’s purse now contains 2,100 coins, and the bank has only 7,900 coins left.
ja: プレーヤーの財布は現在2,100個のコインを含みます、そして、胴元は7,900個のコインだけが残っています。

source: The player’s starting square is “square zero”, which is just off the bottom-left corner of the board.
ja: プレーヤーの出発する正方形は「正方形ゼロ」です、それは、盤の左下の角からちょっと離れています。

source: The point (0, 0) would match case (0, 0) first, and so all other matching cases would be ignored.
ja: 点(0, 0)は最初のcase (0, 0)に合います、それで他の適合するケース節すべては無視されます。

source: The postfix ? operator makes an optional-chaining expression from an expression without changing the expression’s value.
ja: 接尾辞?演算子は、オプショナル連鎖式をある式から、その式の値を変更することなく作ります。

source: The precedence of an operator specifies how tightly the operator binds to its operands, in the absence of grouping parentheses.
ja: ある演算子の優先順位は、どのくらいきつくその演算子をそれの演算数に束縛するかを、グループ化の丸括弧がないところで指定します。

source: The present section describes which characters can be used to define custom operators.
ja: いま目の前の節は、どの文字があつらえの演算子を定義するために使われることができるかを記述します。

source: The previous example shows how to retrieve the value of a property of optional type through optional chaining.
ja: 前の例は、オプショナル連鎖を通してオプショナルの型のプロパティの値を取り出す方法を示します。

source: The previous example uses KeyValuePairs [https://developer.apple.com/documentation/swift/keyvaluepairs] as the parameter type so that callers can include duplicate parameter labels—a and b appear multiple times in the call to repeat.
ja: 前の例は、KeyValuePairs [https://developer.apple.com/documentation/swift/keyvaluepairs]をパラメータ型として使います、それで呼び出し側は重複するパラメータラベルを含むことができます — aとbは複数回repeatの呼び出しにおいて現れます。

source: The primary use of implicitly unwrapped optionals in Swift is during class initialization, as described in Unowned References and Implicitly Unwrapped Optional Properties.
ja: スウィフトでの暗黙的にアンラップされるオプショナルの主要な利用法は、所有参照と暗黙的にアンラップされるオプショナルのプロパティで記述されるように、クラス初期化の間にあります。

source: The principle of finding the index of a value in an array isn’t useful only for strings, however.
ja: しかし、配列の中の値のインデックスを見つける原理は、文字列のためにだけ役立つわけではありません。

source: The problem lies with the equality check, “if value == valueToFind”.
ja: 問題は、同等性検査if value == valueToFindに横たわります。

source: The process is repeated until number is equal to 0, at which point the output string is returned by the closure, and is added to the output array by the map(_:) method.
ja: この処理はnumberが0に等しくなるまで繰り返されます、その時点でoutput文字列がクロージャによって返されて、そしてmap(_:)メソッドによって出力配列に加えられます。

source: The process of defining your own implementations of the == and != operators is described in Equivalence Operators.
ja: ==および!=演算子のあなた独自の実装を定義する過程は、等価演算子で記述されます。

source: The process of initializing a structure’s declared properties is described in Initialization.
ja: ある構造体の宣言されたプロパティを初期化する過程は、初期化で記述されます。

source: The program begins executing a loop by calling the next() method on the iterator.
ja: プログラムは、そのイテレータ上でnext()メソッドを呼ぶことによってループの実行を始めます。

source: The program executes the statements, and execution continues to step 2.
ja: プログラムが文を実行します、そして実行はステップ２に続きます。

source: The program executes the statements, and execution returns to step 1.
ja: プログラムは文を実行します、そして実行はステップ１に戻ります。

source: The projected value has the same access control level as the original wrapped property.
ja: 予測値は、元のラップされたプロパティと同じアクセス制御水準を持ちます。

source: The properties of a frozen structure can’t have property observers, and expressions that provide the initial value for stored instance properties must follow the same restrictions as inlinable functions, as discussed in inlinable.
ja: 凍結構造体のプロパティは、ブロパティオブザーバを持つことが出来ません、そして格納インスタンスプロパティに初期値を提供する式は、インライン可能関数と同じ制約に従わなければなりません、inlinableで記述されるように。

source: The property wrapper still provides all of the initial values, like the earlier example that used TwelveOrLess in SmallRectangle.
ja: プロパティラッパーは、依然として初期値のすべてを提供します、SmallRectangleでのTwelveOrLessを使った前の例のように。

source: The protocol also specifies whether each property must be gettable or gettable and settable.
ja: プロトコルはまた、各プロパティが取得可能または取得可能かつまた設定可能でなければならないかどうか指定します。

source: The protocol can then be adopted by a class, structure, or enumeration to provide an actual implementation of those requirements.
ja: そのプロトコルは、それから、クラス、構造体、または列挙によって採用されることで、それらの要件の実際の実装を提供することができます。

source: The protocol doesn’t define what Item is—that information is left for any conforming type to provide.
ja: このプロトコルは、Itemが何であるかを定義しません ― その情報は、何であれそれに準拠する型が提供するようにそのままにされます。

source: The protocol doesn’t specify anything else about the nature of the conforming type—it only specifies that the type must be able to provide a full name for itself.
ja: このプロトコルは、その準拠型の性質について何ら指定しません ― それはただその型がそれ自身のフルネームを提供できなければならないことだけを指定します。

source: The protocol doesn’t specify whether the property should be a stored property or a computed property—it only specifies the required property name and type.
ja: プロトコルは、そのプロパティが格納プロパティまたは計算プロパティでなければならないかどうかは指定しません ― それは、必要なプロパティ名と型を指定するだけです。

source: The protocol name is provided after the type name, separated by a colon, and an implementation of all requirements of the protocol is provided within the extension’s curly braces.
ja: プロトコル名は、型名の後にコロンで区切られて提供されます、そして、プロトコルの全ての要件の実装は、拡張の波括弧内で提供されます。

source: The protocol only specifies the three bits of functionality that any type must provide in order to be considered a Container.
ja: プロトコルは、どんな型でもContainerとみなされるためには提供しなければならない小さな３つの機能性を指定するだけです。

source: The protocol states that any FullyNamed type must have a gettable instance property called fullName, which is of type String.
ja: このプロトコルは、あらゆるFullyNamed型はfullNameと呼ばれる、String型である、取得可能なインスタンスプロパティを持たなければならないことを述べます。

source: The question mark indicates that the value it contains is optional, meaning that it might contain some Int value, or it might contain no value at all.
ja: 疑問符はそれが含む値がオプショナルであることを示します、そしてそれが何かのInt値を含むかもしれない、あるいはそれがまったく値を含まないかもしれないことを意味しています。

source: The range of numbers that can be stored in an integer constant or variable is different for each numeric type.
ja: 整数の定数または変数に格納されることができる数の範囲は、それぞれの数の型で異なります。

source: The raw value for a particular enumeration case is always the same.
ja: 特定の列挙ケース節のための生の値は、常に同じものです。

source: The raw value initializer is a failable initializer, because not every raw value will return an enumeration case.
ja: 生の値のイニシャライザは、失敗できるイニシャライザです、なぜなら、すべての生の値が列挙ケース節を返すわけではないからです。

source: The read access ends before the write access starts, so there isn’t a conflict.
ja: 読み出しアクセスは書き込みアクセスが始まる前に終わります、それでそれらは衝突しません。

source: The read and write accesses refer to the same memory and they overlap, producing a conflict.
ja: 読み出しと書き込みアクセスは同じメモリを参照してそれらはオーバーラッブして、衝突を生み出しています。

source: The red component is obtained by performing a bitwise AND between the numbers 0xCC6699 and 0xFF0000.
ja: 赤の構成要素は、数0xCC6699と0xFF0000との間のビット単位の論理積を実行することによって得られます。

source: The reference is called a “strong” reference because it keeps a firm hold on that instance, and does not allow it to be deallocated for as long as that strong reference remains.
ja: この参照が「強い」参照と呼ばれるのはそれがそのインスタンスに対する堅い支配力を保つからです、そしてその強い参照が残る限りは、そのインスタンスがメモリ割り当て解除されるのを許しません。

source: The relationship between Customer and CreditCard is slightly different from the relationship between Apartment and Person seen in the weak reference example above.
ja: CustomerとCreditCardの関係は、上の弱い参照の例で見られるApartmentとPersonの関係と少しばかり異なります。

source: The remainder is treated the same way and may be split again.
ja: 剰余は、同じ方法で扱われて、そして再び分割されるでしょう。

source: The remainder operator (%) is also known as a modulo operator in other languages.
ja: 剰余演算子（%）は、また、他の言語ではモジュロ演算子として知られています。

source: The remaining arguments can appear in any order and specify additional information about the declaration’s life cycle, including important milestones.
ja: 残りの引数は、随意の順序で現れることができて、追加的な情報を宣言の寿命について、重要なマイルストーンを含めて指定します。

source: The remaining bits (known as the value bits) store the actual value.
ja: 残っているビット（値ビットとして知られるもの）は、実際の値を格納します。

source: The requirement to always return a single type doesn’t prevent you from using generics in an opaque return type.
ja: 常に単一の型を返すという要件は、あなたが総称体を不透明戻り型において使う妨げになりません。

source: The response to a survey question cannot be known until it is asked, and so the response property is declared with a type of String?, or “optional String”.
ja: 意識調査への回答は、それが尋ねられるまでは知られることができません、なのでresponseプロパティはString?の型、すなわち「オプショナルのString」を使って宣言されます。

source: The restriction against overlapping access to properties of a structure isn’t always necessary to preserve memory safety.
ja: 構造体のプロパティに対するオーバーラップするアクセスを禁じる制限は、メモリ安全を守るために必ずしも必要ではありません。

source: The result is a sequence of diceRoll values that is always 1, 2, 3, 4, 5, 6, 1, 2 and so on.
ja: 結果は一連のdiceRoll値で、それは常に1、2、3、4、5、6、1、2など、となります。

source: The result is a specialized version of that generic type.
ja: 結果は、その総称体型の特殊化版です。

source: The result is exactly the same as if you place an exclamation point after a normal optional that doesn’t contain a value.
ja: その結果は、あなたが値を含まない通常のオプショナルの後に感嘆符を置いた場合と正確に同じものです。

source: The result of item as? Movie is of type Movie?, or “optional Movie”.
ja: item as? Movieの結果は、Movie?型、すなわち「オプショナルのMovie」です。

source: The result of flipping a triangle is a value of type Shape, and the protoFlip(_:) function takes an argument of some type that conforms to the Shape protocol.
ja: 三角形を裏返すことの結果は、型Shapeの値です、そしてprotoFlip(_:)関数はShapeプロトコルに準拠する型の引数を取ります。

source: The result of the i == 1 comparison is of type Bool, and so this second example passes the type-check.
ja: i == 1の比較の結果は型Boolです、それでこの第二の例は型チェックを通ります。
